clear all
syms x y z
T=[0,0,0];
p1=[-80.06,907.1,-290.1];
p2=[39.19,893.7,-290.4];
p3=[8.376,977.5,-285];
% p1=[1.18303,0.672323,3.13041];
% 
% p2=[-0.993955,0.722315,2.98949];
% 
% p3=[-0.544865,0.668108,3.14098];

%%那么求解下面矩阵q行列式

q=[ones(4,1),[[x y z];p1;p2;p3]]; 
d=det(q);
%%d就是3D下的平面方程，形如 Ax+By+Cz+D=0，A、B、C、D均为常数

Z=solve(d,z);%用于画图，此时变形为 Z=ax+by+c，a、b、c均为常数
ezmesh(Z)%画出该3D平面
hold on

A=59025/11975303;
B=3173529/47901212;
C=-1;
D=-167559475911/479012120;
long=abs(D)/sqrt(A*A+B*B+C*C);






